public class Main {
    public static void main(String[] args) {
        task1();
        task2();
        task3();
        task4();
        task5();
        task6();
        task7();
    }

    public static void task1() {
// С помощью цикла for выведите в консоль все числа от 1 до 10.
        System.out.println("\nЗадача 1");
        for (int i = 0; i <= 10; i++)
        System.out.println(i);
    }

    public static void task2() {
// С помощью цикла for выведите в консоль все числа от 10 до 1.
        System.out.println("\nЗадача 2");
        for (int i = 10; i >= 1; i--)
            System.out.println(i);
    }

    public static void task3() {
        //Выведите в консоль все четные числа от 0 до 17.
        System.out.println("\nЗадача 3");

        for (int i = 0; i<=17; i= i+2)
            System.out.println(i);
    }

    public static void task4() {
//Выведите в консоль все числа от 10 до −10 от бо́льшего числа к меньшему.
        System.out.println("\nЗадача 4");
    for (int i = 10; i>=-10; i--)
        System.out.println(i);
    }

    public static void task5() {

        System.out.println("\nЗадача 5");

    }

    public static void task6() {

        System.out.println("\nЗадача 6");

    }

    public static void task7() {

        System.out.println("\nЗадача 7");

    }
}